zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
/*
 * Copyright (c) 2026 Texas Instruments Incorporated
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT ti_mspm0_i2c

/* Zephyr includes */
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/mspm0_clock_control.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/dt-bindings/i2c/i2c.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/sys_io.h>
#include <soc.h>

#include "i2c-priv.h"

/*
 * MSPM0 I2C hardware register offsets
 */

/* GPRCM (Power/Reset/Clock management) */
#define I2C_REG_PWREN  0x0800
#define I2C_REG_RSTCTL 0x0804
#define I2C_REG_CLKCFG 0x0808

/* Top-level clock and debug */
#define I2C_REG_CLKDIV  0x1000
#define I2C_REG_CLKSEL  0x1004
#define I2C_REG_PDBGCTL 0x1018

/* CPU interrupt registers */
#define I2C_REG_CPU_INT_IIDX  0x1020
#define I2C_REG_CPU_INT_IMASK 0x1028
#define I2C_REG_CPU_INT_RIS   0x1030
#define I2C_REG_CPU_INT_MIS   0x1038
#define I2C_REG_CPU_INT_ISET  0x1040
#define I2C_REG_CPU_INT_ICLR  0x1048

/* Glitch filter and timeout */
#define I2C_REG_GFCTL       0x1200
#define I2C_REG_TIMEOUT_CTL 0x1204
#define I2C_REG_TIMEOUT_CNT 0x1208

/* Controller registers */
#define I2C_REG_CSA      0x1210
#define I2C_REG_CCTR     0x1214
#define I2C_REG_CSR      0x1218
#define I2C_REG_CRXDATA  0x121C
#define I2C_REG_CTXDATA  0x1220
#define I2C_REG_CTPR     0x1224
#define I2C_REG_CCR      0x1228
#define I2C_REG_CFIFOCTL 0x1238
#define I2C_REG_CFIFOSR  0x123C

/* Target registers */
#define I2C_REG_TOAR     0x1250
#define I2C_REG_TCTR     0x1258
#define I2C_REG_TRXDATA  0x1260
#define I2C_REG_TTXDATA  0x1264
#define I2C_REG_TACKCTL  0x1268
#define I2C_REG_TFIFOCTL 0x126C
#define I2C_REG_TFIFOSR  0x1270

/* GPRCM: Power / Reset */
#define I2C_PWREN_UNLOCK_KEY       ((uint32_t)0x26000000U)
#define I2C_PWREN_ENABLE           BIT(0)
#define I2C_RSTCTL_UNLOCK_KEY      ((uint32_t)0xB1000000U)
#define I2C_RSTCTL_CLEAR_RESETSTKY BIT(1)
#define I2C_RSTCTL_ASSERT_RESET    BIT(0)

/* Clock */
#define I2C_CLKSEL_MFCLK_SELECT_MASK  BIT(2)
#define I2C_CLKSEL_MFCLK_SELECT       BIT(2)
#define I2C_CLKSEL_BUSCLK_SELECT_MASK BIT(3)
#define I2C_CLKSEL_BUSCLK_SELECT      BIT(3)
#define I2C_CLKDIV_DIVIDE_RATIO_MASK  GENMASK(2, 0)
#define I2C_CLKDIV_RATIO_DIVIDE_BY_1  0

#define I2C_CLKCFG_BLOCK_ASYNC      BIT(8)
#define I2C_CLKCFG_BLOCK_ASYNC_MASK BIT(8)

/* Glitch filter */
#define I2C_GFCTL_ANALOG_GLITCH_FILTER_MASK BIT(8)

/* Timeout */
#define I2C_TIMEOUT_CTL_LOAD_VALUE_MASK     GENMASK(7, 0)
#define I2C_TIMEOUT_CTL_COUNTER_ENABLE      BIT(15)
#define I2C_TIMEOUT_CTL_COUNTER_ENABLE_MASK BIT(15)

/* Controller: CSA (Target Address) - aliases for macro construction */
#define I2C_CSA_SADDR_MASK I2C_TSA_SADDR_MASK
#define I2C_CSA_DIR_MASK   I2C_TSA_DIR_MASK
#define I2C_CSA_MMODE_MASK I2C_TSA_MMODE_MASK

/* Controller: CSA (Target Address) */
#define I2C_TSA_SADDR_MASK   GENMASK(10, 1)
#define I2C_TSA_DIR_MASK     BIT(0)
#define I2C_TSA_DIR_TRANSMIT 0
#define I2C_TSA_DIR_RECEIVE  BIT(0)
#define I2C_TSA_MMODE_MASK   BIT(15)
#define I2C_TSA_MMODE_MODE7  0
#define I2C_TSA_MMODE_MODE10 BIT(15)

/* Controller: CCTR (Control) */
#define I2C_CCTR_BURSTRUN_MASK   BIT(0)
#define I2C_CCTR_BURSTRUN_ENABLE BIT(0)
#define I2C_CCTR_START_MASK      BIT(1)
#define I2C_CCTR_START_DISABLE   0
#define I2C_CCTR_START_ENABLE    BIT(1)
#define I2C_CCTR_STOP_MASK       BIT(2)
#define I2C_CCTR_STOP_DISABLE    0
#define I2C_CCTR_STOP_ENABLE     BIT(2)
#define I2C_CCTR_ACK_MASK        BIT(3)
#define I2C_CCTR_ACK_DISABLE     0
#define I2C_CCTR_ACK_ENABLE      BIT(3)
#define I2C_CCTR_MBLEN_MASK      GENMASK(27, 16)

/* Controller: CSR (Status) */
#define I2C_CSRERR_MASK BIT(1)

/* Controller: RX/TX data */
#define I2C_CRXDATA_VALUE_MASK GENMASK(7, 0)

/* Controller: CCR (Configuration) */
#define I2C_CCR_ACTIVE_MASK            BIT(0)
#define I2C_CCR_ACTIVE_ENABLE          BIT(0)
#define I2C_CCR_CLKSTRETCH_ENABLE      BIT(2)
#define I2C_CCR_CLKSTRETCH_ENABLE_MASK BIT(2)

/* Controller: CFIFOCTL / CFIFOSR */
#define I2C_CFIFOCTL_TXTRIG_MASK      GENMASK(2, 0)
#define I2C_CFIFOCTL_TXTRIG_LEVEL_1   FIELD_PREP(GENMASK(2, 0), 1)
#define I2C_CFIFOCTL_TXFLUSH_MASK     BIT(7)
#define I2C_CFIFOCTL_TXFLUSH          BIT(7)
#define I2C_CFIFOCTL_RXTRIG_MASK      GENMASK(10, 8)
#define I2C_CFIFOCTL_RXTRIG_LEVEL_1   FIELD_PREP(GENMASK(10, 8), 0)
#define I2C_CFIFOSR_TXFIFOCNT_MASK    GENMASK(11, 8)
#define I2C_CFIFOSR_TXFIFOCNT_MINIMUM 0
#define I2C_CFIFOSR_RXFIFOCNT_MASK    GENMASK(3, 0)
#define I2C_CFIFOSR_RXFIFOCNT_MINIMUM 0

/* Target: TOAR (Own Address) */
#define I2C_TOAR_OAR_MASK     GENMASK(9, 0)
#define I2C_TOAR_SMODE_MASK   BIT(15)
#define I2C_TOAR_SMODE_MODE7  0
#define I2C_TOAR_SMODE_MODE10 BIT(15)

/* Target: TCTR (Control) */
#define I2C_TCTR_ACTIVE_MASK                 BIT(0)
#define I2C_TCTR_ACTIVE_ENABLE               BIT(0)
#define I2C_TCTR_SCLKSTRETCH_ENABLE          BIT(2)
#define I2C_TCTR_SCLKSTRETCH_ENABLE_MASK     BIT(2)
#define I2C_TCTR_TXEMPTY_ON_TREQ_ENABLE      BIT(3)
#define I2C_TCTR_TXEMPTY_ON_TREQ_ENABLE_MASK BIT(3)
#define I2C_TCTR_TXTRIG_TXMODE_ENABLE        BIT(4)
#define I2C_TCTR_TXTRIG_TXMODE_ENABLE_MASK   BIT(4)
#define I2C_TCTR_SWUEN_MASK                  BIT(10)

/* Target: TACKCTL */
#define I2C_TACKCTL_ACKOVAL_MASK    BIT(1)
#define I2C_TACKCTL_ACKOVAL_DISABLE 0      /* ACK  */
#define I2C_TACKCTL_ACKOVAL_ENABLE  BIT(1) /* NACK */

/* Target: TFIFOCTL / TFIFOSR */
#define I2C_TFIFOCTL_TXTRIG_MASK      GENMASK(2, 0)
#define I2C_TFIFOCTL_TXFLUSH_MASK     BIT(7)
#define I2C_TFIFOCTL_TXFLUSH          BIT(7)
#define I2C_TFIFOCTL_RXTRIG_MASK      GENMASK(10, 8)
#define I2C_TFIFOSR_TXFIFOCNT_MASK    GENMASK(11, 8)
#define I2C_TFIFOSR_TXFIFOCNT_MINIMUM 0
#define I2C_TFIFOSR_RXFIFOCNT_MASK    GENMASK(3, 0)
#define I2C_TFIFOSR_RXFIFOCNT_MINIMUM 0

/* Target: RX/TX data */
#define I2C_TRXDATA_VALUE_MASK GENMASK(7, 0)

/* CPU_INT: IIDX values (pending interrupt index) */
#define I2C_CPU_INT_IIDX_STAT_CRXDONEFG    0x00000001U
#define I2C_CPU_INT_IIDX_STAT_CTXDONEFG    0x00000002U
#define I2C_CPU_INT_IIDX_STAT_CRXFIFOTRG   0x00000003U
#define I2C_CPU_INT_IIDX_STAT_CTXFIFOTRG   0x00000004U
#define I2C_CPU_INT_IIDX_STAT_CNACKFG      0x00000008U
#define I2C_CPU_INT_IIDX_STAT_CSTOPFG      0x0000000AU
#define I2C_CPU_INT_IIDX_STAT_CARBLOSTFG   0x0000000BU
#define I2C_CPU_INT_IIDX_STAT_TIMEOUTA_EVT 0x0000000FU
#define I2C_CPU_INT_IIDX_STAT_TRXDONEFG    0x00000011U
#define I2C_CPU_INT_IIDX_STAT_TTXEMPTY     0x00000016U
#define I2C_CPU_INT_IIDX_STAT_TSTARTFG     0x00000017U
#define I2C_CPU_INT_IIDX_STAT_TSTOPFG      0x00000018U

/* CPU_INT: IMASK bit positions (interrupt enable/mask) */
#define I2C_CPU_INT_IMASK_CRXDONE_SET    BIT(0)
#define I2C_CPU_INT_IMASK_CTXDONE_SET    BIT(1)
#define I2C_CPU_INT_IMASK_CRXFIFOTRG_SET BIT(2)
#define I2C_CPU_INT_IMASK_CTXFIFOTRG_SET BIT(3)
#define I2C_CPU_INT_IMASK_CNACK_SET      BIT(7)
#define I2C_CPU_INT_IMASK_CSTOP_SET      BIT(9)
#define I2C_CPU_INT_IMASK_CARBLOST_SET   BIT(10)
#define I2C_CPU_INT_IMASK_TIMEOUT_A_SET  BIT(14)
#define I2C_CPU_INT_IMASK_TRXDONE_SET    BIT(16)
#define I2C_CPU_INT_IMASK_TTXEMPTY_SET   BIT(21)
#define I2C_CPU_INT_IMASK_TSTART_SET     BIT(22)
#define I2C_CPU_INT_IMASK_TSTOP_SET      BIT(23)

LOG_MODULE_REGISTER(i2c_mspm0, CONFIG_I2C_LOG_LEVEL);

