zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
/* FIFO depth (device-specific via Kconfig) */
#define I2C_FIFO_DEPTH CONFIG_MSPM0_I2C_FIFO_DEPTH

/* CLKCFG config values */
#define I2C_CLKCFG_BLOCK_ASYNC BIT(8)

/* Local macro definitions for register values */
#define I2C_CONTROLLER_STOP_ENABLE              I2C_CCTR_STOP_ENABLE
#define I2C_CONTROLLER_STOP_DISABLE             I2C_CCTR_STOP_DISABLE
#define I2C_CONTROLLER_START_ENABLE             I2C_CCTR_START_ENABLE
#define I2C_CONTROLLER_START_DISABLE            I2C_CCTR_START_DISABLE
#define I2C_CONTROLLER_ACK_ENABLE               I2C_CCTR_ACK_ENABLE
#define I2C_CONTROLLER_ACK_DISABLE              I2C_CCTR_ACK_DISABLE
#define I2C_CONTROLLER_DIRECTION_TX             I2C_TSA_DIR_TRANSMIT
#define I2C_CONTROLLER_DIRECTION_RX             I2C_TSA_DIR_RECEIVE
#define I2C_TX_FIFO_LEVEL_BYTES_1               I2C_CFIFOCTL_TXTRIG_LEVEL_1
#define I2C_RX_FIFO_LEVEL_BYTES_1               I2C_CFIFOCTL_RXTRIG_LEVEL_1
#define I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK  I2C_TACKCTL_ACKOVAL_DISABLE
#define I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK I2C_TACKCTL_ACKOVAL_ENABLE
#define I2C_CONTROLLER_STATUS_ERROR             I2C_CSRERR_MASK
#define I2C_CLOCK_DIVIDE_1                      I2C_CLKDIV_RATIO_DIVIDE_BY_1

/* Startup delay in cycles */
#define POWER_STARTUP_DELAY 16

/* Helper macro for register field update */
#define I2C_UPDATE_REG(base, reg, bit, value)                                                      \
	sys_write32((sys_read32((base) + I2C_REG_##reg) & ~(I2C_##reg##_##bit##_MASK)) |           \
			    ((value) & I2C_##reg##_##bit##_MASK),                                  \
		    (base) + I2C_REG_##reg)

/* Local clock configuration struct to replace DL_I2C_ClockConfig */
typedef struct {
	uint32_t clock_sel;
	uint32_t divide_ratio;
} i2c_clock_config_t;

#define TI_MSPM0_CONTROLLER_INTERRUPTS                                                             \
	(I2C_CPU_INT_IMASK_CARBLOST_SET | I2C_CPU_INT_IMASK_CNACK_SET |                            \
	 I2C_CPU_INT_IMASK_CRXFIFOTRG_SET | I2C_CPU_INT_IMASK_CRXDONE_SET |                        \
	 I2C_CPU_INT_IMASK_CTXDONE_SET | I2C_CPU_INT_IMASK_TIMEOUT_A_SET |                         \
	 I2C_CPU_INT_IMASK_CSTOP_SET)

/*
 * Mask covering all possible controller interrupt sources, including
 * I2C_CPU_INT_IMASK_CTXFIFOTRG_SET which is dynamically
 * enabled/disabled during multi-byte transmits. Used in the dual-role ISR
 * dispatcher to distinguish controller from target interrupts via MIS.
 */
#define TI_MSPM0_CONTROLLER_INTERRUPTS_ALL                                                         \
	(TI_MSPM0_CONTROLLER_INTERRUPTS | I2C_CPU_INT_IMASK_CTXFIFOTRG_SET)

#define TI_MSPM0_TARGET_INTERRUPTS                                                                 \
	(I2C_CPU_INT_IMASK_TRXDONE_SET | I2C_CPU_INT_IMASK_TTXEMPTY_SET |                          \
	 I2C_CPU_INT_IMASK_TSTART_SET | I2C_CPU_INT_IMASK_TSTOP_SET |                              \
	 I2C_CPU_INT_IMASK_TIMEOUT_A_SET)

enum i2c_mspm0_state {
	I2C_MSPM0_IDLE,
	I2C_MSPM0_TX_STARTED,
	I2C_MSPM0_TX_INPROGRESS,
	I2C_MSPM0_TX_COMPLETE,
	I2C_MSPM0_RX_STARTED,
	I2C_MSPM0_RX_INPROGRESS,
	I2C_MSPM0_RX_COMPLETE,
	I2C_MSPM0_TARGET_STARTED,
	I2C_MSPM0_TARGET_TX_INPROGRESS,
	I2C_MSPM0_TARGET_RX_INPROGRESS,
	I2C_MSPM0_TARGET_PREEMPTED,
	I2C_MSPM0_TIMEOUT,
	I2C_MSPM0_ERROR,
};

struct i2c_mspm0_config {
	mm_reg_t base;
	uint32_t bitrate;
	i2c_clock_config_t clock_config;
	struct mspm0_sys_clock *clock_subsys;
	const struct pinctrl_dev_config *pinctrl;
	void (*irq_config_func)(const struct device *dev);
	uint32_t controller_tx_fifo_threshold; /* pre-encoded TXTRIG field value */
	uint32_t controller_rx_fifo_threshold; /* pre-encoded RXTRIG field value */
};

struct i2c_mspm0_data {
	uint32_t dev_config;
	volatile enum i2c_mspm0_state state;
	struct k_sem i2c_lock;
	struct k_sem device_sync_sem;
	uint32_t transfer_count;
	uint32_t transfer_len;
	uint8_t *msg_buf;

	/* Direct user messages, consumed by ISR */
	struct i2c_msg *msgs;
	uint8_t num_msgs;
	uint8_t msg_idx;

	uint16_t addr;
	int transfer_ret;

#ifdef CONFIG_I2C_TARGET
	struct i2c_target_config *target_config;
	const struct i2c_target_callbacks *target_callbacks;
#endif /* CONFIG_I2C_TARGET */
	bool is_target;
};

/* Power management helpers */
static inline void i2c_enable_power(mm_reg_t base)
{
	sys_write32(I2C_PWREN_UNLOCK_KEY | I2C_PWREN_ENABLE, base + I2C_REG_PWREN);
}

static inline void i2c_reset(mm_reg_t base)
{
	sys_write32(I2C_RSTCTL_UNLOCK_KEY | I2C_RSTCTL_CLEAR_RESETSTKY | I2C_RSTCTL_ASSERT_RESET,
		    base + I2C_REG_RSTCTL);
}

static inline void i2c_disable_async_clk_req(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CLKCFG, BLOCK_ASYNC, I2C_CLKCFG_BLOCK_ASYNC);
}

/* Clock configuration helper */
static inline void i2c_set_clock_config(mm_reg_t base, const i2c_clock_config_t *config)
{
	I2C_UPDATE_REG(base, CLKSEL, BUSCLK_SELECT, config->clock_sel);
	I2C_UPDATE_REG(base, CLKSEL, MFCLK_SELECT, config->clock_sel);

	I2C_UPDATE_REG(base, CLKDIV, DIVIDE_RATIO, config->divide_ratio);
}

/* Glitch filter helpers */
static inline void i2c_disable_analog_glitch_filter(mm_reg_t base)
{
	I2C_UPDATE_REG(base, GFCTL, ANALOG_GLITCH_FILTER, 0);
}

/* Controller control helpers */
static inline void i2c_reset_controller_transfer(mm_reg_t base)
{
	sys_write32(0x00, base + I2C_REG_CCTR);
}

static inline void i2c_enable_controller(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CCR, ACTIVE, I2C_CCR_ACTIVE_ENABLE);
}

static inline void i2c_disable_controller(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CCR, ACTIVE, 0);
}

static inline void i2c_enable_controller_clock_stretching(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CCR, CLKSTRETCH_ENABLE, I2C_CCR_CLKSTRETCH_ENABLE);
}

static inline void i2c_set_timer_period(mm_reg_t base, uint8_t period)
{
	sys_write32(period, base + I2C_REG_CTPR);
}

static inline uint32_t i2c_get_controller_status(mm_reg_t base)
{
	return sys_read32(base + I2C_REG_CSR);
}

/* FIFO control helpers */
static inline void i2c_set_controller_tx_fifo_threshold(mm_reg_t base, uint32_t level)
{
	I2C_UPDATE_REG(base, CFIFOCTL, TXTRIG, level);
}

static inline void i2c_set_controller_rx_fifo_threshold(mm_reg_t base, uint32_t level)
{
	I2C_UPDATE_REG(base, CFIFOCTL, RXTRIG, level);
}

