zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
static inline void i2c_start_flush_controller_tx_fifo(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CFIFOCTL, TXFLUSH, I2C_CFIFOCTL_TXFLUSH);
}

static inline void i2c_stop_flush_controller_tx_fifo(mm_reg_t base)
{
	I2C_UPDATE_REG(base, CFIFOCTL, TXFLUSH, 0);
}

static inline bool i2c_is_controller_tx_fifo_empty(mm_reg_t base)
{
	return ((sys_read32(base + I2C_REG_CFIFOSR) & I2C_CFIFOSR_TXFIFOCNT_MASK) ==
		FIELD_PREP(I2C_CFIFOSR_TXFIFOCNT_MASK, I2C_FIFO_DEPTH));
}

static inline bool i2c_is_controller_tx_fifo_full(mm_reg_t base)
{
	return ((sys_read32(base + I2C_REG_CFIFOSR) & I2C_CFIFOSR_TXFIFOCNT_MASK) ==
		I2C_CFIFOSR_TXFIFOCNT_MINIMUM);
}

static inline bool i2c_is_controller_rx_fifo_empty(mm_reg_t base)
{
	return ((sys_read32(base + I2C_REG_CFIFOSR) & I2C_CFIFOSR_RXFIFOCNT_MASK) ==
		I2C_CFIFOSR_RXFIFOCNT_MINIMUM);
}

static inline void i2c_transmit_controller_data(mm_reg_t base, uint8_t data)
{
	sys_write32(data, base + I2C_REG_CTXDATA);
}

static inline uint8_t i2c_receive_controller_data(mm_reg_t base)
{
	return (uint8_t)(sys_read32(base + I2C_REG_CRXDATA) & I2C_CRXDATA_VALUE_MASK);
}

/* Multi-byte FIFO operations */
static uint16_t i2c_fill_controller_tx_fifo(mm_reg_t base, const uint8_t *buffer, uint16_t count)
{
	uint16_t i;

	for (i = 0; i < count; i++) {
		if (!i2c_is_controller_tx_fifo_full(base)) {
			i2c_transmit_controller_data(base, buffer[i]);
		} else {
			break;
		}
	}
	return i;
}

static void i2c_flush_controller_tx_fifo(mm_reg_t base)
{
	i2c_start_flush_controller_tx_fifo(base);
	while (!i2c_is_controller_tx_fifo_empty(base)) {
		/* Wait for FIFO to empty */
	}
	i2c_stop_flush_controller_tx_fifo(base);
}

/* Controller transfer control */
static inline void i2c_start_controller_transfer_advanced(mm_reg_t base, uint32_t targetAddr,
							  uint32_t direction, uint16_t length,
							  uint32_t start, uint32_t stop,
							  uint32_t ack, uint32_t addr_mode)
{
	/* Set target address, direction, and addressing mode (7 or 10-bit) */
	I2C_UPDATE_REG(base, CSA, SADDR, FIELD_PREP(I2C_TSA_SADDR_MASK, targetAddr));
	I2C_UPDATE_REG(base, CSA, DIR, direction);
	I2C_UPDATE_REG(base, CSA, MMODE, addr_mode);

	/*
	 * Set control register:
	 * I2C_UPDATE_REG can't be used here as the bits of this register directly
	 * control the transfer and have to be updated all at once.
	 */
	uint32_t cctr = 0;

	cctr |= FIELD_PREP(I2C_CCTR_MBLEN_MASK, length);
	cctr |= I2C_CCTR_BURSTRUN_ENABLE;
	cctr |= start;
	cctr |= stop;
	cctr |= ack;

	sys_write32(cctr, base + I2C_REG_CCTR);
}

/* Timeout helpers (if CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS != 0) */
static inline void i2c_enable_timeout_a(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TIMEOUT_CTL, COUNTER_ENABLE, I2C_TIMEOUT_CTL_COUNTER_ENABLE);
}

static inline void i2c_set_timeout_a_count(mm_reg_t base, uint32_t count)
{
	I2C_UPDATE_REG(base, TIMEOUT_CTL, LOAD_VALUE, count);
}

/* Interrupt helpers */
static inline void i2c_enable_interrupt(mm_reg_t base, uint32_t interruptMask)
{
	sys_write32(sys_read32(base + I2C_REG_CPU_INT_IMASK) | interruptMask,
		    base + I2C_REG_CPU_INT_IMASK);
}

static inline void i2c_disable_interrupt(mm_reg_t base, uint32_t interruptMask)
{
	sys_write32(sys_read32(base + I2C_REG_CPU_INT_IMASK) & ~interruptMask,
		    base + I2C_REG_CPU_INT_IMASK);
}

static inline void i2c_clear_interrupt_status(mm_reg_t base, uint32_t interruptMask)
{
	sys_write32(interruptMask, base + I2C_REG_CPU_INT_ICLR);
}

static inline uint32_t i2c_get_enabled_interrupt_status(mm_reg_t base, uint32_t interruptMask)
{
	return (sys_read32(base + I2C_REG_CPU_INT_MIS) & interruptMask);
}

static inline uint32_t i2c_get_pending_interrupt(mm_reg_t base)
{
	return sys_read32(base + I2C_REG_CPU_INT_IIDX);
}

/* Workaround for errata I2C_ERR_04: always disable target wakeup on init */
static inline void i2c_disable_target_wakeup(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, SWUEN, 0);
}

/* Target mode helpers (CONFIG_I2C_TARGET) */
#ifdef CONFIG_I2C_TARGET
static inline void i2c_enable_target(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, ACTIVE, I2C_TCTR_ACTIVE_ENABLE);
}

static inline void i2c_disable_target(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, ACTIVE, 0);
}

static inline void i2c_set_target_own_address(mm_reg_t base, uint32_t addr, uint32_t addr_mode)
{
	I2C_UPDATE_REG(base, TOAR, OAR, addr);
	I2C_UPDATE_REG(base, TOAR, SMODE, addr_mode);
}

static inline void i2c_enable_target_clock_stretching(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, SCLKSTRETCH_ENABLE, I2C_TCTR_SCLKSTRETCH_ENABLE);
}

static inline void i2c_enable_target_tx_trigger_in_tx_mode(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, TXTRIG_TXMODE_ENABLE, I2C_TCTR_TXTRIG_TXMODE_ENABLE);
}

static inline void i2c_enable_target_tx_empty_on_tx_request(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TCTR, TXEMPTY_ON_TREQ_ENABLE, I2C_TCTR_TXEMPTY_ON_TREQ_ENABLE);
}

static inline void i2c_set_target_tx_fifo_threshold(mm_reg_t base, uint32_t level)
{
	I2C_UPDATE_REG(base, TFIFOCTL, TXTRIG, level);
}

static inline void i2c_set_target_rx_fifo_threshold(mm_reg_t base, uint32_t level)
{
	I2C_UPDATE_REG(base, TFIFOCTL, RXTRIG, level);
}

static inline void i2c_flush_target_tx_fifo(mm_reg_t base)
{
	I2C_UPDATE_REG(base, TFIFOCTL, TXFLUSH, I2C_TFIFOCTL_TXFLUSH);

	while ((sys_read32(base + I2C_REG_TFIFOSR) & I2C_TFIFOSR_TXFIFOCNT_MASK) !=
	       FIELD_PREP(I2C_TFIFOSR_TXFIFOCNT_MASK, I2C_FIFO_DEPTH)) {
		/* Wait */
	}

	I2C_UPDATE_REG(base, TFIFOCTL, TXFLUSH, 0);
}

static inline bool i2c_is_target_rx_fifo_empty(mm_reg_t base)
{
	return ((sys_read32(base + I2C_REG_TFIFOSR) & I2C_TFIFOSR_RXFIFOCNT_MASK) ==
		I2C_TFIFOSR_RXFIFOCNT_MINIMUM);
}

static inline uint8_t i2c_receive_target_data(mm_reg_t base)
{
	return (uint8_t)(sys_read32(base + I2C_REG_TRXDATA) & I2C_TRXDATA_VALUE_MASK);
}

static inline void i2c_transmit_target_data(mm_reg_t base, uint8_t data)
{
	sys_write32(data, base + I2C_REG_TTXDATA);
}

static inline bool i2c_is_target_tx_fifo_full(mm_reg_t base)
{
	return ((sys_read32(base + I2C_REG_TFIFOSR) & I2C_TFIFOSR_TXFIFOCNT_MASK) ==
		I2C_TFIFOSR_TXFIFOCNT_MINIMUM);
}

static inline bool i2c_transmit_target_data_check(mm_reg_t base, uint8_t data)
{
	if (i2c_is_target_tx_fifo_full(base)) {
		return false;
	}

	i2c_transmit_target_data(base, data);
	return true;
}

