zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
static inline void i2c_set_target_ack_override_value(mm_reg_t base, uint32_t value)
{
	I2C_UPDATE_REG(base, TACKCTL, ACKOVAL, value);
}
#endif /* CONFIG_I2C_TARGET */

#if CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS != 0
static int i2c_mspm0_configure_timeout(const struct device *dev, uint32_t period,
				       uint32_t timeout_ms)
{
	const struct i2c_mspm0_config *config = dev->config;
	const mm_reg_t base = config->base;
	const struct device *clk_dev = DEVICE_DT_GET(DT_NODELABEL(ckm));
	uint32_t clock_rate;
	uint32_t tick_cycles;
	uint64_t timeout_cycles;
	uint32_t ticks_needed;
	uint16_t counter_value;
	int ret;

	ret = clock_control_get_rate(clk_dev, config->clock_subsys, &clock_rate);
	if (ret < 0) {
		return ret;
	}

	/* Each count is equal to (1 + TPR) * 12 functional clocks */
	tick_cycles = (period + 1) * 12;
	timeout_cycles = (uint64_t)timeout_ms * (clock_rate / 1000);
	ticks_needed = (timeout_cycles + tick_cycles - 1) / tick_cycles;
	/* Lower 4-bits of counter are automatically set to 0x0 */
	counter_value = ticks_needed >> 4;

	if (counter_value > 0xFF) {
		LOG_WRN("SCL low timeout (%u ms) too large for clock rate; "
			"clamping to maximum hardware value",
			timeout_ms);
		counter_value = 0xFF;
	}

	i2c_enable_timeout_a(base);
	i2c_set_timeout_a_count(base, counter_value);
	return 0;
}
#endif /* CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS != 0 */

static int i2c_mspm0_configure(const struct device *dev, uint32_t dev_config)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;
	const struct device *const clk_dev = DEVICE_DT_GET(DT_NODELABEL(ckm));
	uint32_t clock_rate;
	uint32_t desired_speed;
	int32_t tpr_val;
	int ret;

	ret = clock_control_get_rate(clk_dev, config->clock_subsys, &clock_rate);
	if (ret < 0) {
		return -ENODEV;
	}

	k_sem_take(&data->i2c_lock, K_FOREVER);

	/* Config I2C speed */
	switch (I2C_SPEED_GET(dev_config)) {
	case I2C_SPEED_STANDARD:
		desired_speed = 100000;
		break;
	case I2C_SPEED_FAST:
		desired_speed = 400000;
		break;
	case I2C_SPEED_FAST_PLUS:
		desired_speed = 1000000;
		break;
	case I2C_SPEED_DT:
		desired_speed = config->bitrate;
		break;
	default:
		ret = -EINVAL;
		goto sem_give;
	}

	/* Calculate the timer period based on the desired period and clock rate.
	 *
	 * Per TRM, the value stored in the Timer Period (TPR_Val) creates a
	 * period from the following equation:
	 * Desired Period = (1 + TPR_Val) X (10) X clock_rate
	 *
	 * Solving the above equation for TPR_VAL given a desired period yields
	 * the following:
	 *
	 * TPR_val = ceiling(clock_rate/(desired_speed * 10)) - 1
	 *
	 * The ceiling is chosen such that a non-clean divide gives a period
	 * greater than the desired rather than lower. This means that the
	 * frequency will thus be lower, and the frequency bounds are considered
	 * preferred.
	 */
	tpr_val = DIV_ROUND_UP(clock_rate, (desired_speed * 10)) - 1;

	/* Set the I2C speed */
	if (tpr_val <= 0) {
		ret = -EINVAL;
		goto sem_give;
	}

	i2c_set_timer_period(base, tpr_val);

#if CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS != 0
	ret = i2c_mspm0_configure_timeout(dev, tpr_val, CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS);
	if (ret < 0) {
		goto sem_give;
	}
#endif /* CONFIG_MSPM0_I2C_SCL_LOW_TIMEOUT_MS */

	/* Config other settings */
	i2c_set_controller_tx_fifo_threshold(base, config->controller_tx_fifo_threshold);
	i2c_set_controller_rx_fifo_threshold(base, config->controller_rx_fifo_threshold);
	i2c_enable_controller_clock_stretching(base);

	/* Disable Async clock request */
	i2c_disable_async_clk_req(base);

	/* Configure Interrupts */
	i2c_enable_interrupt(base, TI_MSPM0_CONTROLLER_INTERRUPTS);

	/* Enable module */
	i2c_enable_controller(base);
	data->dev_config = dev_config;

sem_give:
	k_sem_give(&data->i2c_lock);
	return ret;
}

static int i2c_mspm0_init(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;
	int ret;
	uint32_t speed_config;

	/* initialize semaphores */
	k_sem_init(&data->i2c_lock, 1, 1);
	k_sem_init(&data->device_sync_sem, 0, 1);

	/* Init power */
	i2c_reset(base);
	i2c_enable_power(base);

	/* Wait for peripheral power to stabilize (POST_KERNEL, so k_busy_wait is available) */
	k_busy_wait(1);
	i2c_reset_controller_transfer(base);
#ifdef CONFIG_I2C_TARGET
	/* Workaround for errata I2C_ERR_04 */
	i2c_disable_target_wakeup(base);
#endif
	/* Init GPIO */
	ret = pinctrl_apply_state(config->pinctrl, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	/* Config clocks and analog filter */
	i2c_set_clock_config(base, &config->clock_config);
	i2c_disable_analog_glitch_filter(base);

	/* Set frequency */
	speed_config = i2c_map_dt_bitrate(config->bitrate);
	ret = i2c_mspm0_configure(dev, speed_config);
	if (ret < 0) {
		return ret;
	}

	/* Enable interrupts */
	config->irq_config_func(dev);

	return 0;
}

static int i2c_mspm0_get_config(const struct device *dev, uint32_t *dev_config)
{
	struct i2c_mspm0_data *data = dev->data;
	*dev_config = data->dev_config;

	return 0;
}

static int i2c_mspm0_reset_controller(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	const mm_reg_t base = config->base;

	i2c_reset(base);

	/* Wait for peripheral power to stabilize (POST_KERNEL, so k_busy_wait is available) */
	k_busy_wait(k_cyc_to_us_ceil32(POWER_STARTUP_DELAY));

#ifdef CONFIG_I2C_TARGET
	/* Workaround for errata I2C_ERR_04 */
	i2c_disable_target_wakeup(base);
#endif

	/* Config clocks and analog filter */
	i2c_set_clock_config(base, &config->clock_config);
	i2c_disable_analog_glitch_filter(base);

	/* Configure Controller Mode */
	i2c_reset_controller_transfer(base);

	/* Config other settings */
	i2c_set_controller_tx_fifo_threshold(base, config->controller_tx_fifo_threshold);
	i2c_set_controller_rx_fifo_threshold(base, config->controller_rx_fifo_threshold);
	i2c_enable_controller_clock_stretching(base);

	/* Configure Interrupts */
	i2c_clear_interrupt_status(base, TI_MSPM0_CONTROLLER_INTERRUPTS);
	i2c_enable_interrupt(base, TI_MSPM0_CONTROLLER_INTERRUPTS);

	/* Enable module */
	i2c_enable_controller(base);

