zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
	return 0;
}

/* Start transfer for msgs[msg_idx] */
static void i2c_mspm0_start_dispatch(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;
	const struct i2c_msg *msg = &data->msgs[data->msg_idx];
	uint32_t addr_mode =
		(msg->flags & I2C_MSG_ADDR_10_BITS) ? I2C_TSA_MMODE_MODE10 : I2C_TSA_MMODE_MODE7;
	uint32_t stop = (msg->flags & I2C_MSG_STOP) ? I2C_CONTROLLER_STOP_ENABLE
						  : I2C_CONTROLLER_STOP_DISABLE;

	data->msg_buf = msg->buf;
	data->transfer_count = 0;
	data->transfer_len = msg->len;

	if ((msg->flags & I2C_MSG_RW_MASK) == I2C_MSG_READ) {
		data->state = I2C_MSPM0_RX_STARTED;
		i2c_start_controller_transfer_advanced(
			base, data->addr, I2C_CONTROLLER_DIRECTION_RX, msg->len,
			I2C_CONTROLLER_START_ENABLE, stop, I2C_CONTROLLER_ACK_DISABLE, addr_mode);
	} else {
		data->state = I2C_MSPM0_IDLE;
		i2c_flush_controller_tx_fifo(base);
		data->transfer_count = i2c_fill_controller_tx_fifo(base, msg->buf, msg->len);

		if (data->transfer_count < data->transfer_len) {
			i2c_enable_interrupt(base, I2C_CPU_INT_IMASK_CTXFIFOTRG_SET);
		} else {
			i2c_disable_interrupt(base, I2C_CPU_INT_IMASK_CTXFIFOTRG_SET);
		}

		data->state = I2C_MSPM0_TX_STARTED;
		i2c_start_controller_transfer_advanced(
			base, data->addr, I2C_CONTROLLER_DIRECTION_TX, msg->len,
			I2C_CONTROLLER_START_ENABLE, stop, I2C_CONTROLLER_ACK_ENABLE, addr_mode);
	}
}

static int i2c_mspm0_transfer(const struct device *dev, struct i2c_msg *msgs, uint8_t num_msgs,
			      uint16_t addr)
{
	struct i2c_mspm0_data *data = dev->data;
	uint32_t dev_config;
	int ret = 0;

	k_sem_take(&data->i2c_lock, K_FOREVER);

	data->msgs = msgs;
	data->num_msgs = num_msgs;
	data->msg_idx = 0;
	data->addr = addr;
	data->transfer_ret = 0;

	/* Send the first message */
	i2c_mspm0_start_dispatch(dev);

	/*
	 * Block once for the entire multi-message transfer. The ISR transmits
	 * all dispatch[..] messages and gives device_sync_sem.
	 */
	if (k_sem_take(&data->device_sync_sem, K_MSEC(CONFIG_I2C_TRANSFER_TIMEOUT_MS))) {
		data->transfer_ret = -ETIMEDOUT;
	}

	ret = data->transfer_ret;

	/* Timeout recovery */
	if (ret == -ETIMEDOUT) {
		/*
		 * The ISR may or may not have already released i2c_lock via the
		 * TIMEOUTA/MSTOPFG path. Give it unconditionally here before
		 * calling reset_controller() and configure(), both of which take
		 * i2c_lock themselves. The semaphore is initialised with max=1
		 * so an extra give is harmless if the ISR already released it.
		 */
		i2c_mspm0_get_config(dev, &dev_config);
		i2c_mspm0_reset_controller(dev);
		i2c_mspm0_configure(dev, dev_config);
	}

	k_sem_give(&data->i2c_lock);
	return ret;
}

#ifdef CONFIG_I2C_TARGET
static int i2c_mspm0_target_register(const struct device *dev, struct i2c_target_config *cfg)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;

	/* Device is already registered as target */
	if (data->is_target || data->target_config == cfg) {
		return -EBUSY;
	}

	k_sem_take(&data->i2c_lock, K_FOREVER);

	data->target_config = cfg;
	data->target_callbacks = cfg->callbacks;

	if (data->state == I2C_MSPM0_TARGET_PREEMPTED) {
		i2c_clear_interrupt_status(base, TI_MSPM0_TARGET_INTERRUPTS);
	}

	/*
	 * The controller can remain enabled for dual-role operation
	 * (simultaneous controller and target on the same bus). We keep the
	 * controller and its interrupts active so that controller transfers
	 * can still be initiated while the target is registered.
	 */
	i2c_set_target_tx_fifo_threshold(base, I2C_TX_FIFO_LEVEL_BYTES_1);
	i2c_set_target_rx_fifo_threshold(base, I2C_RX_FIFO_LEVEL_BYTES_1);
	i2c_enable_target_tx_trigger_in_tx_mode(base);
	i2c_enable_target_tx_empty_on_tx_request(base);
	i2c_enable_target_clock_stretching(base);
	i2c_set_target_own_address(base, data->target_config->address,
				   (data->target_config->flags & I2C_TARGET_FLAGS_ADDR_10_BITS)
					   ? I2C_TOAR_SMODE_MODE10
					   : I2C_TOAR_SMODE_MODE7);

	i2c_clear_interrupt_status(base, I2C_CPU_INT_IMASK_TTXEMPTY_SET);
	i2c_enable_interrupt(base, TI_MSPM0_TARGET_INTERRUPTS);
	i2c_enable_target(base);

	data->is_target = true;
	data->state = I2C_MSPM0_IDLE;

	k_sem_give(&data->i2c_lock);
	return 0;
}

static int i2c_mspm0_target_unregister(const struct device *dev, struct i2c_target_config *cfg)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;

	if (data->is_target == false) {
		return 0;
	}

	k_sem_take(&data->i2c_lock, K_FOREVER);

	data->target_config = NULL;
	data->is_target = false;

	i2c_disable_target(base);
	i2c_disable_interrupt(base, TI_MSPM0_TARGET_INTERRUPTS);

	k_sem_give(&data->i2c_lock);
	return 0;
}

static int i2c_mspm0_reset_target(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;

	i2c_reset(base);

	/* Wait for peripheral power to stabilize (POST_KERNEL, so k_busy_wait is available) */
	k_busy_wait(1);

	i2c_disable_target_wakeup(base);

	/* Config clocks and analog filter */
	i2c_set_clock_config(base, &config->clock_config);
	i2c_disable_analog_glitch_filter(base);

	i2c_set_target_own_address(base, data->target_config->address,
				   (data->target_config->flags & I2C_TARGET_FLAGS_ADDR_10_BITS)
					   ? I2C_TOAR_SMODE_MODE10
					   : I2C_TOAR_SMODE_MODE7);
	i2c_set_target_tx_fifo_threshold(base, I2C_TX_FIFO_LEVEL_BYTES_1);
	i2c_set_target_rx_fifo_threshold(base, I2C_RX_FIFO_LEVEL_BYTES_1);
	i2c_enable_target_tx_trigger_in_tx_mode(base);
	i2c_enable_target_tx_empty_on_tx_request(base);

	i2c_clear_interrupt_status(base, I2C_CPU_INT_IMASK_TTXEMPTY_SET);

	i2c_enable_interrupt(base, TI_MSPM0_TARGET_INTERRUPTS);

	data->state = I2C_MSPM0_IDLE;

	/* Enable module */
	i2c_enable_target(base);

	return 0;
}

static void i2c_mspm0_isr_target(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;
	int ret;
	uint8_t tx_byte;
	uint8_t rx_byte;

	switch (i2c_get_pending_interrupt(base)) {
	case I2C_CPU_INT_IIDX_STAT_TSTARTFG:
		data->state = I2C_MSPM0_TARGET_STARTED;
		/* Flush TX FIFO to clear out any stale data */
		i2c_flush_target_tx_fifo(base);
		break;
	case I2C_CPU_INT_IIDX_STAT_TRXDONEFG:
		if (data->state == I2C_MSPM0_TARGET_STARTED) {
			data->state = I2C_MSPM0_TARGET_RX_INPROGRESS;
			if (data->target_callbacks->write_requested != NULL) {
				ret = data->target_callbacks->write_requested(data->target_config);
				if (ret == 0) {
					i2c_set_target_ack_override_value(
						base, I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK);
				} else {
					i2c_set_target_ack_override_value(
						base, I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK);
				}
			}
		}
		/* Store received data in buffer */
		if (data->target_callbacks->write_received != NULL) {
			while (i2c_is_target_rx_fifo_empty(base) != true) {
				rx_byte = i2c_receive_target_data(base);
				ret = data->target_callbacks->write_received(data->target_config,
									     rx_byte);
				if (ret == 0) {
					i2c_set_target_ack_override_value(
						base, I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK);
				} else {
					i2c_set_target_ack_override_value(
						base, I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK);
				}
			}
		} else {
			i2c_receive_target_data(base);
			i2c_set_target_ack_override_value(base,
							  I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_TTXEMPTY:
		if (data->state == I2C_MSPM0_TARGET_STARTED) {
			/* First byte detected from a read request */
			data->state = I2C_MSPM0_TARGET_TX_INPROGRESS;
			if (data->target_callbacks->read_requested != NULL) {
				ret = data->target_callbacks->read_requested(data->target_config,
									     &tx_byte);
				if (ret == 0) {
					i2c_transmit_target_data(base, tx_byte);
				} else {
					/* In this case, no new data is desired to be filled, thus
					 * 0's are transmitted
					 */
					i2c_transmit_target_data(base, 0x00);
				}
			} else {
				/* read_requested function is not found. The target data will
				 * continue to transmit to fulfill the error and not hang
				 * the controller by stretching indefinitely
				 */
				i2c_transmit_target_data_check(base, 0xFF);
			}
		} else {
			/* still using the FIFO, we call read_processed in order to add
			 * additional data rather than from a buffer. If the write-received
			 * function chooses to return 0 (no more data present), then 0's will
			 * be filled in
			 */
			if (data->target_callbacks->read_processed != NULL) {
				ret = data->target_callbacks->read_processed(data->target_config,
									     &tx_byte);

				if (ret == 0) {
					i2c_transmit_target_data(base, tx_byte);
				} else {
					/* In this case, no new data is desired to be filled, thus
					 * 0's are transmitted
					 */
					i2c_transmit_target_data(base, 0x00);
				}
			} else {
				/* Read_processed function is not found. The target data will
				 * continue to transmit to fulfill the error and not hang
				 * the controller by stretching indefinitely
				 */
				i2c_transmit_target_data_check(base, 0xFF);
			}
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_TSTOPFG:
		data->state = I2C_MSPM0_IDLE;
		if (data->target_callbacks->stop) {
			data->target_callbacks->stop(data->target_config);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_TIMEOUTA_EVT:
		i2c_disable_interrupt(base, TI_MSPM0_TARGET_INTERRUPTS);
		i2c_clear_interrupt_status(base, TI_MSPM0_TARGET_INTERRUPTS);
		if (data->target_callbacks->error) {
			data->target_callbacks->error(data->target_config, I2C_ERROR_TIMEOUT);
		}
		if (data->target_callbacks->stop) {
			data->target_callbacks->stop(data->target_config);
		}
		i2c_mspm0_reset_target(dev);
		k_sem_give(&data->i2c_lock);
		break;
	default:
		break;
	}
}
#endif /* CONFIG_I2C_TARGET */

