zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
static inline void i2c_mspm0_isr_controller(const struct device *dev)
{
	const struct i2c_mspm0_config *config = dev->config;
	struct i2c_mspm0_data *data = dev->data;
	const mm_reg_t base = config->base;

	switch (i2c_get_pending_interrupt(base)) {
	case I2C_CPU_INT_IIDX_STAT_CRXDONEFG:
		/*
		 * Transfer complete. Drain any bytes remaining in the RX FIFO.
		 * With a threshold > 1, MRXFIFOTRG only fires when >= threshold
		 * bytes are present; bytes that arrived after the last trigger
		 * (or transfers shorter than the threshold) sit in the FIFO
		 * and must be drained here.
		 */
		while (i2c_is_controller_rx_fifo_empty(base) != true) {
			if (data->transfer_count < data->transfer_len) {
				data->msg_buf[data->transfer_count++] =
					i2c_receive_controller_data(base);
			} else {
				i2c_receive_controller_data(base);
			}
		}
		data->state = I2C_MSPM0_RX_COMPLETE;

		/* Advance the state machine to the next message */
		data->msg_idx++;
		if (data->msg_idx < data->num_msgs) {
			i2c_mspm0_start_dispatch(dev);
		} else {
			/* All messages complete: wake the transfer thread */
			data->state = I2C_MSPM0_IDLE;
			k_sem_give(&data->device_sync_sem);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_CTXDONEFG:
		i2c_disable_interrupt(base, I2C_CPU_INT_IMASK_CTXFIFOTRG_SET);
		data->state = I2C_MSPM0_TX_COMPLETE;

		data->msg_idx++;
		if (data->msg_idx < data->num_msgs) {
			i2c_mspm0_start_dispatch(dev);
		} else {
			data->state = I2C_MSPM0_IDLE;
			k_sem_give(&data->device_sync_sem);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_CRXFIFOTRG:
		/* Receive all bytes from target */
		if (data->state != I2C_MSPM0_RX_COMPLETE) {
			data->state = I2C_MSPM0_RX_INPROGRESS;
		}
		while (i2c_is_controller_rx_fifo_empty(base) != true) {
			if (data->transfer_count < data->transfer_len) {
				data->msg_buf[data->transfer_count++] =
					i2c_receive_controller_data(base);
			} else {
				/* Ignore if transaction length exceeded */
				i2c_receive_controller_data(base);
			}
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_CTXFIFOTRG:
		data->state = I2C_MSPM0_TX_INPROGRESS;
		/* Fill TX FIFO with next bytes to send */
		if (data->transfer_count < data->transfer_len) {
			data->transfer_count += i2c_fill_controller_tx_fifo(
				base, &data->msg_buf[data->transfer_count],
				data->transfer_len - data->transfer_count);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_CNACKFG:
		if ((data->state == I2C_MSPM0_RX_STARTED) ||
		    (data->state == I2C_MSPM0_TX_STARTED)) {
			/* NACK interrupt if I2C Target is disconnected */
			data->state = I2C_MSPM0_ERROR;
			data->transfer_ret = -EIO;
			k_sem_give(&data->device_sync_sem);
			/*
			 * Release the bus lock now. The hardware may still
			 * generate a STOP after a NACK, but the subsequent
			 * MSTOPFG give is harmless (semaphore max=1, clamped).
			 */
			k_sem_give(&data->i2c_lock);
		}
		break;
	case I2C_CPU_INT_IIDX_STAT_CARBLOSTFG:
		/*
		 * Arbitration lost: another controller won the bus. Signal the
		 * error to the waiting transfer so it returns -EIO promptly
		 * rather than blocking until the software timeout expires.
		 * Release i2c_lock immediately; a subsequent STOP give is safe
		 * since the semaphore is capped at max=1.
		 */
		data->state = I2C_MSPM0_ERROR;
		data->transfer_ret = -EIO;
		k_sem_give(&data->device_sync_sem);
		k_sem_give(&data->i2c_lock);
		break;
	case I2C_CPU_INT_IIDX_STAT_TIMEOUTA_EVT:
		data->state = I2C_MSPM0_TIMEOUT;
		data->transfer_ret = -ETIMEDOUT;
		k_sem_give(&data->device_sync_sem);
		i2c_disable_interrupt(base, TI_MSPM0_CONTROLLER_INTERRUPTS);
		i2c_clear_interrupt_status(base, TI_MSPM0_CONTROLLER_INTERRUPTS);
		i2c_flush_controller_tx_fifo(base);
		__fallthrough;
	case I2C_CPU_INT_IIDX_STAT_CSTOPFG:
		k_sem_give(&data->i2c_lock);
	default:
		break;
	}
}

static inline void i2c_mspm0_isr(const struct device *dev)
{
	struct i2c_mspm0_data *data = dev->data;

#ifdef CONFIG_I2C_TARGET
	if (data->is_target) {
		const struct i2c_mspm0_config *config = dev->config;
		const mm_reg_t base = config->base;

		/*
		 * In dual-role mode the controller and target hardware are
		 * independent, so both controller and target interrupts can fire.
		 * Use the MIS register (non-destructive read) to classify the
		 * pending interrupt before dispatching to the appropriate handler.
		 * TIMEOUT_A is shared; when a controller transfer is active
		 * treat it as a controller interrupt.
		 */
		uint32_t mis =
			i2c_get_enabled_interrupt_status(base, TI_MSPM0_CONTROLLER_INTERRUPTS_ALL);

		if (mis != 0) {
			i2c_mspm0_isr_controller(dev);
		} else {
			i2c_mspm0_isr_target(dev);
		}
		return;
	}
#endif
	i2c_mspm0_isr_controller(dev);
}

static DEVICE_API(i2c, i2c_mspm0_driver_api) = {
	.configure = i2c_mspm0_configure,
	.get_config = i2c_mspm0_get_config,
	.transfer = i2c_mspm0_transfer,
#ifdef CONFIG_I2C_RTIO
	.iodev_submit = i2c_iodev_submit_fallback,
#endif
#ifdef CONFIG_I2C_TARGET
	.target_register = i2c_mspm0_target_register,
	.target_unregister = i2c_mspm0_target_unregister,
#endif
};

/*
 * Convert the DT byte-count property to the pre-encoded FIFO register field
 * values written into MFIFOCTL/SFIFOCTL at init time.
 *
 * TX: TXTRIG field = raw byte count, stored in bits [2:0].
 * RX: RXTRIG field = (byte count - 1), stored in bits [10:8].
 */
#define TX_FIFO_THRESHOLD(index)                                                                   \
	FIELD_PREP(I2C_CFIFOCTL_TXTRIG_MASK, DT_INST_PROP(index, controller_tx_fifo_threshold))

#define RX_FIFO_THRESHOLD(index)                                                                   \
	FIELD_PREP(I2C_CFIFOCTL_RXTRIG_MASK, DT_INST_PROP(index, controller_rx_fifo_threshold) - 1)

#define I2C_MSPM0_CONFIG_IRQ_FUNC(index)                                                           \
	static void i2c_mspm0_irq_config_func_##index(const struct device *dev)                    \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), i2c_mspm0_isr,      \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

