zephyrproject-rtos/zephyr/drivers/i2c/i2c_mspm0.c
#define MSP_I2C_INIT_FN(index)                                                                     \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
	static struct mspm0_sys_clock mspm0_i2c_clockSys##index = MSPM0_CLOCK_SUBSYS_FN(index);    \
	I2C_MSPM0_CONFIG_IRQ_FUNC(index)                                                           \
	static const struct i2c_mspm0_config i2c_mspm0_cfg_##index = {                             \
		.base = DT_INST_REG_ADDR(index),                                                   \
		.clock_subsys = &mspm0_i2c_clockSys##index,                                        \
		.bitrate = DT_INST_PROP(index, clock_frequency),                                   \
		.pinctrl = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                     \
		.irq_config_func = i2c_mspm0_irq_config_func_##index,                      \
		.controller_tx_fifo_threshold = TX_FIFO_THRESHOLD(index),                  \
		.controller_rx_fifo_threshold = RX_FIFO_THRESHOLD(index),                  \
		.clock_config = {                                                          \
			.clock_sel = MSPM0_CLOCK_PERIPH_REG_MASK(                          \
				DT_INST_CLOCKS_CELL(index, clk)),                          \
			.divide_ratio = I2C_CLOCK_DIVIDE_1,                                \
		}};                                                                        \
	static struct i2c_mspm0_data i2c_mspm0_data_##index;                                       \
	I2C_DEVICE_DT_INST_DEFINE(index, i2c_mspm0_init, NULL, &i2c_mspm0_data_##index,            \
				  &i2c_mspm0_cfg_##index, POST_KERNEL, CONFIG_I2C_INIT_PRIORITY,   \
				  &i2c_mspm0_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSP_I2C_INIT_FN)
